# AnalyticalSupportCycleWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalSupportCycleWarning Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Circular support chain detected
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalSupportCycleWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalSupportCycleWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalSupportCycleWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace